<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковой ресурс модуля H-RBAC
    |--------------------------------------------------------------------------
    */

    'actions' => 'Действия',
    'add' => 'Добавить',
    'choose' => 'Выберите...',
    'conflict' => 'Конфликт разрешений',
    'edit' => 'Редактировать',
    'exclude' => 'Изъять',
    'excluded' => 'Изъято',
    'include' => 'Предоставить',
    'included' => 'Предоставлено',
    'kind' => 'Вид',
    'param' => 'Параметр',
    'params' => 'Параметры',
    'permission' => 'Разрешение',
    'permissions_for' => 'Разрешения для :User',
    'provided_by_role' => 'Предоставлено одной из ролей',
    'role' => 'Роль',
    'sure' => 'Вы уверены?',
    'user_roles' => 'Роли пользователя',
    'value' => 'Значение',


    'PermissionPolicy' => [
        '_description'   => 'Работа с разрешениями',

        'managePermissions'   => 'Назначение разрешений пользователю',
    ],


    'PostPolicy' => [
        '_description'   => 'Работа с публикациями',

        'edit' => 'Редактирование публикаций',
        'editAnyPost' => 'Редактировать любые публикации',
        'editOwnPost' => 'Редактировать собственные публикации',
        'editFixedPost' => 'Редактировать заранее определенные публикации',

        'delete' => 'Удаление публикаций',
        'deleteAnyPost' => 'Удалять любые публикации',
    ],
];
